In [109]:
people={"last":"Farhan","first":"mustafa","email":"Farhanmustafa@gmial.com"}
people

{'last': 'Farhan', 'first': 'mustafa', 'email': 'Farhanmustafa@gmial.com'}

In [110]:
people={"last":["Farhan"],"first":["mustafa"],"email":["Farhanmustafa@gmial.com"]}
people

{'last': ['Farhan'],
 'first': ['mustafa'],
 'email': ['Farhanmustafa@gmial.com']}

In [111]:
people={"firstname":["Farhan","nishanth","akshay","sanchay"],"lastname":["mustafa","kumar","kumar","swaraj"],"email":["Farhanmustafa@gmial.com","nishantkumar@gmail.com","akshaykumar@gmail.com","sanchayswaraj@gmail.com"]}
people

{'firstname': ['Farhan', 'nishanth', 'akshay', 'sanchay'],
 'lastname': ['mustafa', 'kumar', 'kumar', 'swaraj'],
 'email': ['Farhanmustafa@gmial.com',
  'nishantkumar@gmail.com',
  'akshaykumar@gmail.com',
  'sanchayswaraj@gmail.com']}

In [112]:
import pandas as pd

In [113]:
df=pd.DataFrame(people)
df

  firstname lastname                    email
0    Farhan  mustafa  Farhanmustafa@gmial.com
1  nishanth    kumar   nishantkumar@gmail.com
2    akshay    kumar    akshaykumar@gmail.com
3   sanchay   swaraj  sanchayswaraj@gmail.com

In [114]:
people["email"]     #this returns list

['Farhanmustafa@gmial.com',
 'nishantkumar@gmail.com',
 'akshaykumar@gmail.com',
 'sanchayswaraj@gmail.com']

In [115]:
df["email"]              #this returns the dataframe called as tabular form with indexes or seriesty

0    Farhanmustafa@gmial.com
1     nishantkumar@gmail.com
2      akshaykumar@gmail.com
3    sanchayswaraj@gmail.com
Name: email, dtype: object

In [116]:
df.email         #same as above

0    Farhanmustafa@gmial.com
1     nishantkumar@gmail.com
2      akshaykumar@gmail.com
3    sanchayswaraj@gmail.com
Name: email, dtype: object

In [117]:
type(df["email"])   #it is series because series is list of dataframe in rows of a single column format with many features

pandas.core.series.Series

In [118]:
df[["email","lastname"]]

                     email lastname
0  Farhanmustafa@gmial.com  mustafa
1   nishantkumar@gmail.com    kumar
2    akshaykumar@gmail.com    kumar
3  sanchayswaraj@gmail.com   swaraj

In [119]:
df.columns        #to access columns

Index(['firstname', 'lastname', 'email'], dtype='object')

In [120]:
df.iloc[3]       #as method says it is integerlocation we can access rows with this

firstname                    sanchay
lastname                      swaraj
email        sanchayswaraj@gmail.com
Name: 3, dtype: object

In [121]:
# df.iloc[1:3]         
df.iloc[[1,2]]     #both gives the same output

  firstname lastname                   email
1  nishanth    kumar  nishantkumar@gmail.com
2    akshay    kumar   akshaykumar@gmail.com

In [122]:
df.iloc[[1,2],2]    #here iloc[rows representated by integers.columns also rep. by integers]

1    nishantkumar@gmail.com
2     akshaykumar@gmail.com
Name: email, dtype: object

In [123]:
df.loc[[1,3],"email"] #here we can give labels

1     nishantkumar@gmail.com
3    sanchayswaraj@gmail.com
Name: email, dtype: object

In [124]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [125]:
df.set_index("email")   #this sets index as we wanted by specfing it in braces

                        firstname lastname
email
Farhanmustafa@gmial.com    Farhan  mustafa
nishantkumar@gmail.com   nishanth    kumar
akshaykumar@gmail.com      akshay    kumar
sanchayswaraj@gmail.com   sanchay   swaraj

In [126]:
df              #but it doesn't change the actual dataframe

  firstname lastname                    email
0    Farhan  mustafa  Farhanmustafa@gmial.com
1  nishanth    kumar   nishantkumar@gmail.com
2    akshay    kumar    akshaykumar@gmail.com
3   sanchay   swaraj  sanchayswaraj@gmail.com

In [127]:
df.set_index("email",inplace=True)      #tp change original Dataframe we have to use "inplace=True"

In [128]:
df

                        firstname lastname
email
Farhanmustafa@gmial.com    Farhan  mustafa
nishantkumar@gmail.com   nishanth    kumar
akshaykumar@gmail.com      akshay    kumar
sanchayswaraj@gmail.com   sanchay   swaraj

In [129]:
df.reset_index(inplace=True) #this resets the whole dataframe as the original one

In [130]:
df

                     email firstname lastname
0  Farhanmustafa@gmial.com    Farhan  mustafa
1   nishantkumar@gmail.com  nishanth    kumar
2    akshaykumar@gmail.com    akshay    kumar
3  sanchayswaraj@gmail.com   sanchay   swaraj

In [131]:
df["lastname"]=="kumar"

0    False
1     True
2     True
3    False
Name: lastname, dtype: bool

In [132]:
df.loc[df["lastname"]=="kumar","email"]

1    nishantkumar@gmail.com
2     akshaykumar@gmail.com
Name: email, dtype: object

In [133]:
f1=(df["firstname"]=="sanchay") & (df["lastname"]=="swaraj")

In [134]:
df.loc[f1,"email"]

3    sanchayswaraj@gmail.com
Name: email, dtype: object

In [135]:
df.loc[~f1,"email"]

0    Farhanmustafa@gmial.com
1     nishantkumar@gmail.com
2      akshaykumar@gmail.com
Name: email, dtype: object

In [136]:
f1=(df["firstname"]=="sanchay") | (df["lastname"]=="kumar")
df.loc[~f1,"email"]

0    Farhanmustafa@gmial.com
Name: email, dtype: object

In [137]:
df.columns = ["email_id","first","last"]

In [138]:
df

                  email_id     first     last
0  Farhanmustafa@gmial.com    Farhan  mustafa
1   nishantkumar@gmail.com  nishanth    kumar
2    akshaykumar@gmail.com    akshay    kumar
3  sanchayswaraj@gmail.com   sanchay   swaraj

In [139]:
df.columns=[x.upper() for x in df.columns]       #here we made all columns in uppercase
df

                  EMAIL_ID     FIRST     LAST
0  Farhanmustafa@gmial.com    Farhan  mustafa
1   nishantkumar@gmail.com  nishanth    kumar
2    akshaykumar@gmail.com    akshay    kumar
3  sanchayswaraj@gmail.com   sanchay   swaraj

In [140]:
df.columns = df.columns.str.replace('_',' ')    #here we replaced the underscore with space
df

                  EMAIL ID     FIRST     LAST
0  Farhanmustafa@gmial.com    Farhan  mustafa
1   nishantkumar@gmail.com  nishanth    kumar
2    akshaykumar@gmail.com    akshay    kumar
3  sanchayswaraj@gmail.com   sanchay   swaraj

In [141]:
df.columns=[x.lower() for x in df.columns]    
df.columns = df.columns.str.replace(' ','_') 
df

                  email_id     first     last
0  Farhanmustafa@gmial.com    Farhan  mustafa
1   nishantkumar@gmail.com  nishanth    kumar
2    akshaykumar@gmail.com    akshay    kumar
3  sanchayswaraj@gmail.com   sanchay   swaraj

In [142]:
df.rename(columns={'first':'first_name','last':'last_name'},inplace=True)

In [143]:
df

                  email_id first_name last_name
0  Farhanmustafa@gmial.com     Farhan   mustafa
1   nishantkumar@gmail.com   nishanth     kumar
2    akshaykumar@gmail.com     akshay     kumar
3  sanchayswaraj@gmail.com    sanchay    swaraj

In [144]:
df.loc[1]=['nishantraghava@gmail.com','nishanth','raghava']
df

                   email_id first_name last_name
0   Farhanmustafa@gmial.com     Farhan   mustafa
1  nishantraghava@gmail.com   nishanth   raghava
2     akshaykumar@gmail.com     akshay     kumar
3   sanchayswaraj@gmail.com    sanchay    swaraj

In [145]:
df.at[2,'email_id']='akshaykumar@gmail.com'    #.at can be used to modeify single values of row
df

                   email_id first_name last_name
0   Farhanmustafa@gmial.com     Farhan   mustafa
1  nishantraghava@gmail.com   nishanth   raghava
2     akshaykumar@gmail.com     akshay     kumar
3   sanchayswaraj@gmail.com    sanchay    swaraj

In [146]:
df.loc[1,['email_id','last_name']]=['nishanthkumar@gmail.com','kumar']
df

                  email_id first_name last_name
0  Farhanmustafa@gmial.com     Farhan   mustafa
1  nishanthkumar@gmail.com   nishanth     kumar
2    akshaykumar@gmail.com     akshay     kumar
3  sanchayswaraj@gmail.com    sanchay    swaraj

In [147]:
df['email_id'].str.upper()

0    FARHANMUSTAFA@GMIAL.COM
1    NISHANTHKUMAR@GMAIL.COM
2      AKSHAYKUMAR@GMAIL.COM
3    SANCHAYSWARAJ@GMAIL.COM
Name: email_id, dtype: object

In [148]:
df

                  email_id first_name last_name
0  Farhanmustafa@gmial.com     Farhan   mustafa
1  nishanthkumar@gmail.com   nishanth     kumar
2    akshaykumar@gmail.com     akshay     kumar
3  sanchayswaraj@gmail.com    sanchay    swaraj

In [149]:
df['email_id'].apply(len)      #apply(len) here applies to whole series of email and returens length

0    23
1    23
2    21
3    23
Name: email_id, dtype: int64

In [150]:
def upper_case(email_id):
    return email_id.upper()

In [151]:
df['email_id'].apply(upper_case)

0    FARHANMUSTAFA@GMIAL.COM
1    NISHANTHKUMAR@GMAIL.COM
2      AKSHAYKUMAR@GMAIL.COM
3    SANCHAYSWARAJ@GMAIL.COM
Name: email_id, dtype: object

In [152]:
df['email_id']=df['email_id'].apply(upper_case)

In [153]:
df

                  email_id first_name last_name
0  FARHANMUSTAFA@GMIAL.COM     Farhan   mustafa
1  NISHANTHKUMAR@GMAIL.COM   nishanth     kumar
2    AKSHAYKUMAR@GMAIL.COM     akshay     kumar
3  SANCHAYSWARAJ@GMAIL.COM    sanchay    swaraj

In [154]:
df['email_id']=df['email_id'].apply(lambda x:x.lower())
df

                  email_id first_name last_name
0  farhanmustafa@gmial.com     Farhan   mustafa
1  nishanthkumar@gmail.com   nishanth     kumar
2    akshaykumar@gmail.com     akshay     kumar
3  sanchayswaraj@gmail.com    sanchay    swaraj

In [155]:
df.apply(len)     #returns the series in that dataframe or no of rows, if we apply it om dataframe directly

email_id      4
first_name    4
last_name     4
dtype: int64

In [156]:
df.apply(len,axis='columns')         #this returns no of columns of each row as we changed axis
# len(df['email_id']        #this returns the length of the email_id series which has 4 columns

0    3
1    3
2    3
3    3
dtype: int64

In [157]:
df.apply(pd.Series.min)
# df.apply(lambda x:x.min())             #Both give  same output

email_id      akshaykumar@gmail.com
first_name                   Farhan
last_name                     kumar
dtype: object

In [158]:
df.applymap(len)     #not only length but we can apply many functions to the applymap() to know insights og dataframe

   email_id  first_name  last_name
0        23           6          7
1        23           8          5
2        21           6          5
3        23           7          6

In [159]:
df.applymap(str.upper)

                  email_id first_name last_name
0  FARHANMUSTAFA@GMIAL.COM     FARHAN   MUSTAFA
1  NISHANTHKUMAR@GMAIL.COM   NISHANTH     KUMAR
2    AKSHAYKUMAR@GMAIL.COM     AKSHAY     KUMAR
3  SANCHAYSWARAJ@GMAIL.COM    SANCHAY    SWARAJ

In [160]:
df

                  email_id first_name last_name
0  farhanmustafa@gmial.com     Farhan   mustafa
1  nishanthkumar@gmail.com   nishanth     kumar
2    akshaykumar@gmail.com     akshay     kumar
3  sanchayswaraj@gmail.com    sanchay    swaraj

In [161]:
df['last_name'].map({'mustafa':'akhtar','kumar':'singh'})     #this only updates the mendioned values and assigns other as NaN

0    akhtar
1     singh
2     singh
3       NaN
Name: last_name, dtype: object

In [162]:
df['last_name'].replace({'mustafa':'akhtar','kumar':'singh'})  #but this replaces the mentioned values and doesn't change other values

0    akhtar
1     singh
2     singh
3    swaraj
Name: last_name, dtype: object

In [163]:
df['age']=[20,21,24,20]      #adding columns,

In [164]:
df

                  email_id first_name last_name  age
0  farhanmustafa@gmial.com     Farhan   mustafa   20
1  nishanthkumar@gmail.com   nishanth     kumar   21
2    akshaykumar@gmail.com     akshay     kumar   24
3  sanchayswaraj@gmail.com    sanchay    swaraj   20

In [165]:
df.drop(columns=['age'],inplace=True)      #drop() we can pass columns also by passing arrays

In [166]:
df

                  email_id first_name last_name
0  farhanmustafa@gmial.com     Farhan   mustafa
1  nishanthkumar@gmail.com   nishanth     kumar
2    akshaykumar@gmail.com     akshay     kumar
3  sanchayswaraj@gmail.com    sanchay    swaraj

In [167]:
df['full_name']= df['first_name']+df['last_name']

In [168]:
df

                  email_id first_name last_name      full_name
0  farhanmustafa@gmial.com     Farhan   mustafa  Farhanmustafa
1  nishanthkumar@gmail.com   nishanth     kumar  nishanthkumar
2    akshaykumar@gmail.com     akshay     kumar    akshaykumar
3  sanchayswaraj@gmail.com    sanchay    swaraj  sanchayswaraj

In [169]:
df.drop(columns=['first_name','last_name'],inplace=True)

In [170]:
df

                  email_id      full_name
0  farhanmustafa@gmial.com  Farhanmustafa
1  nishanthkumar@gmail.com  nishanthkumar
2    akshaykumar@gmail.com    akshaykumar
3  sanchayswaraj@gmail.com  sanchayswaraj

In [171]:
df['first_name']=['farhan','nishant','akshay','sanchay']
df['last_name']=['mustafa','kumar','kumar','swaraj']

In [172]:
df

                  email_id      full_name first_name last_name
0  farhanmustafa@gmial.com  Farhanmustafa     farhan   mustafa
1  nishanthkumar@gmail.com  nishanthkumar    nishant     kumar
2    akshaykumar@gmail.com    akshaykumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchayswaraj    sanchay    swaraj

In [214]:
df.drop(columns=['full_name'],inplace=True)

In [215]:
df['full_name']= df['first_name']+' '+df['last_name']   #this shows error because in next step we dropped 2 columns

In [216]:
df.drop(columns=['first_name','last_name'],inplace=True)

In [217]:
df['full_name'].str.split(' ',expand=True)    #here this splits the full_name column into 2 columns respect to spaces
                                                #expand=True will make the list into a dataframe or columns

         0        1
0   farhan  mustafa
1  nishant    kumar
2   akshay    kumar
3  sanchay   swaraj
4    Snoop     Dogg
5     Tyla    Yaweh
6     Post  Mealone
7      NaN      NaN
8      NaN      NaN

In [177]:
df[['first_name','last_name']]=df['full_name'].str.split(' ',expand=True) #here we assigned them to 2 named columns 
df

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj

In [ ]:
p

In [178]:
people2={"first_name":["Snoop","Tyla","Post"],
        "last_name":["Dogg","Yaweh","Mealone"],
        "email_id":["snoopdogg@gmial.com","tylayaweh@gmail.com","postmalone@gmail.com"],
        "full_name":['Snoopdog','tylayaweh','postmalone']}
df2=pd.DataFrame(people2)

In [179]:
df2

  first_name last_name              email_id   full_name
0      Snoop      Dogg   snoopdogg@gmial.com    Snoopdog
1       Tyla     Yaweh   tylayaweh@gmail.com   tylayaweh
2       Post   Mealone  postmalone@gmail.com  postmalone

In [180]:
df=df.append(df2,ignore_index=True,sort=False)      #Here we appended the df2 dataframe to df and here ignore_index will

In [181]:
df

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone

In [182]:
df.drop(index=1)             #we can drop row by specifying index number

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone

In [183]:
filt=df['last_name']=='kumar'
df.drop(index=df[filt].index)

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone

In [184]:
df.sort_values(by='last_name')

                  email_id       full_name first_name last_name
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
6     postmalone@gmail.com      postmalone       Post   Mealone
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj

In [185]:
df.sort_values(by='last_name',ascending=False)

                  email_id       full_name first_name last_name
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg

In [186]:
df.sort_values(by=['last_name','first_name'],ascending=[False,True],inplace=True)

In [187]:
df

                  email_id       full_name first_name last_name
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg

In [188]:
df.sort_index(inplace=True)
df

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone

In [189]:
df3={'email_id':None,'full_name':None,'first_name':None,'last_name':None}
df4={'email_id':'ash@gmail.com','full_name':'NA','first_name':None,'last_name':'Missing'}

In [190]:
df=df.append(df3,ignore_index=True)
df=df.append(df4,ignore_index=True)
df

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone
7                     None            None       None      None
8            ash@gmail.com              NA       None   Missing

In [191]:
df.dropna()   #this drops

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone

In [192]:
df.dropna(axis='index',how='all')   #it only drops if all values of a rows are missing

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone
8            ash@gmail.com              NA       None   Missing

In [193]:
df.dropna(axis='columns',how='any')  #bcoz we have some or the other missing in all the columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8]

In [194]:
df.dropna(axis='index',how='any',subset=['first_name'])  #this subset() checks the sepcific column and drops if not present

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone

In [195]:
df.dropna(axis='index',how='any',subset=['email_id'])

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone
8            ash@gmail.com              NA       None   Missing

In [196]:
import numpy as np

In [197]:
df.replace('Missing',np.nan,inplace=True) #np.nan  is not a number of numpy module
df.replace('NA',np.nan,inplace=True)
df

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone
7                     None            None       None      None
8            ash@gmail.com             NaN       None       NaN

In [198]:
df.isna()

   email_id  full_name  first_name  last_name
0     False      False       False      False
1     False      False       False      False
2     False      False       False      False
3     False      False       False      False
4     False      False       False      False
5     False      False       False      False
6     False      False       False      False
7      True       True        True       True
8     False       True        True       True

In [199]:
df.fillna('private')             #this fillna() will fill the na locations with the given integer or string

                  email_id       full_name first_name last_name
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh
6     postmalone@gmail.com      postmalone       Post   Mealone
7                  private         private    private   private
8            ash@gmail.com         private    private   private

In [200]:
df['age']=['22','23','20','19','43','29','35',np.nan,None]    #added a new column 
df

                  email_id       full_name first_name last_name   age
0  farhanmustafa@gmial.com  farhan mustafa     farhan   mustafa    22
1  nishanthkumar@gmail.com   nishant kumar    nishant     kumar    23
2    akshaykumar@gmail.com    akshay kumar     akshay     kumar    20
3  sanchayswaraj@gmail.com  sanchay swaraj    sanchay    swaraj    19
4      snoopdogg@gmial.com        Snoopdog      Snoop      Dogg    43
5      tylayaweh@gmail.com       tylayaweh       Tyla     Yaweh    29
6     postmalone@gmail.com      postmalone       Post   Mealone    35
7                     None            None       None      None   NaN
8            ash@gmail.com             NaN       None       NaN  None

In [201]:
#df['age'].mean()    # error because age column here is a object not a int to take mean

In [202]:
type(np.nan)

float

In [203]:
df['age']=df['age'].astype(float)    #astype() is used to change the datatype with some rules

In [204]:
df.dtypes  #we can see we changed the datatype of the whole column to float

email_id       object
full_name      object
first_name     object
last_name      object
age           float64
dtype: object

In [205]:
df['age'].mean()

27.285714285714285

In [206]:
# df.to_csv('friends.csv')

In [207]:
# df.to_csv('friendst.csv',sep='\t')

In [208]:
# df.to_excel('friendsxl.xlsx')      #to_excel is to save the

In [209]:
xl_df=pd.read_excel('friendsxl.xlsx')

In [210]:
xl_df

,Unnamed: 0,email_id,full_name,first_name,last_name,age
0,0,farhanmustafa@gmial.com,farhan mustafa,farhan,mustafa,22.0
1,1,nishanthkumar@gmail.com,nishant kumar,nishant,kumar,23.0
2,2,akshaykumar@gmail.com,akshay kumar,akshay,kumar,20.0
3,3,sanchayswaraj@gmail.com,sanchay swaraj,sanchay,swaraj,19.0
4,4,snoopdogg@gmial.com,Snoopdog,Snoop,Dogg,43.0
5,5,tylayaweh@gmail.com,tylayaweh,Tyla,Yaweh,29.0
6,6,postmalone@gmail.com,postmalone,Post,Mealone,35.0
7,7,NaN,NaN,NaN,NaN,NaN
8,8,ash@gmail.com,NaN,NaN,NaN,NaN

In [211]:
# df.to_json('friendsjs.json')

In [212]:
pd.read_json('friendsjs.json',orient='records',lines=True)

,email_id,full_name,first_name,last_name,age
0,"{'0': 'farhanmustafa@gmial.com', '1': 'nishant...","{'0': 'farhan mustafa', '1': 'nishant kumar', ...","{'0': 'farhan', '1': 'nishant', '2': 'akshay',...","{'0': 'mustafa', '1': 'kumar', '2': 'kumar', '...","{'0': 22.0, '1': 23.0, '2': 20.0, '3': 19.0, '..."

In [213]:
pd.date_range('20201010',periods=30)

DatetimeIndex(['2020-10-10', '2020-10-11', '2020-10-12', '2020-10-13',
               '2020-10-14', '2020-10-15', '2020-10-16', '2020-10-17',
               '2020-10-18', '2020-10-19', '2020-10-20', '2020-10-21',
               '2020-10-22', '2020-10-23', '2020-10-24', '2020-10-25',
               '2020-10-26', '2020-10-27', '2020-10-28', '2020-10-29',
               '2020-10-30', '2020-10-31', '2020-11-01', '2020-11-02',
               '2020-11-03', '2020-11-04', '2020-11-05', '2020-11-06',
               '2020-11-07', '2020-11-08'],
              dtype='datetime64[ns]', freq='D')